cats/app/controllers/cats_controller.rb

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
---
    def edit
        debugger
        @cat = Cat.find_by(id: params[:id])

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 28], ["LIMIT", 1]]
UPDATE "cats" SET "description" = $1, "updated_at" = $2 WHERE "cats"."id" = $3  [["description", " Fantastic cat!"], ["updated_at", "2022-05-08 20:57:03.518494"], ["id", 28]]
---
    def update
        debugger
        @cat = Cat.find_by(id: params[:id])
        debugger
        if @cat.update_attributes(cat_params)